espressif/esp-idf/components/soc/soc/esp32s3/include/soc/assist_debug_reg.h
#define ASSIST_DEBUG_CORE_1_INTERRUPT_RAW_REG (DR_REG_ASSIST_DEBUG_BASE + 0x094)
/* ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RAW (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RAW_M (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RAW_S 11
/* ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RAW (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RAW_M (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RAW_S 10
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RAW (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RAW_M (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RAW_S 9
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RAW (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RAW_M (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RAW_S 8
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RAW (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RAW_M (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RAW_S 7
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RAW (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RAW_M (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RAW_S 6
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RAW (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RAW_M (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RAW_S 5
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RAW (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RAW_M (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RAW_S 4
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RAW (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RAW_M (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RAW_S 3
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RAW (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RAW_M (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RAW_S 2
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RAW (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RAW_M (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RAW_S 1
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RAW (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RAW_M (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RAW_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RAW_S 0

#define ASSIST_DEBUG_CORE_1_INTERRUPT_RLS_REG (DR_REG_ASSIST_DEBUG_BASE + 0x098)
/* ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RLS : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RLS (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RLS_M (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_RLS_S 11
/* ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RLS : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RLS (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RLS_M (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_RLS_S 10
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RLS : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RLS (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RLS_M (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_RLS_S 9
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RLS : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RLS (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RLS_M (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_RLS_S 8
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RLS : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RLS (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RLS_M (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_RLS_S 7
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RLS : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RLS (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RLS_M (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_RLS_S 6
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RLS : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RLS (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RLS_M (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_RLS_S 5
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RLS : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RLS (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RLS_M (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_RLS_S 4
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RLS : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RLS (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RLS_M (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_RLS_S 3
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RLS : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RLS (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RLS_M (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_RLS_S 2
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RLS : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RLS (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RLS_M (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_RLS_S 1
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RLS : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RLS (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RLS_M (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RLS_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_RLS_S 0

#define ASSIST_DEBUG_CORE_1_INTERRUPT_CLR_REG (DR_REG_ASSIST_DEBUG_BASE + 0x09C)
/* ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_CLR : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_CLR (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_CLR_M (BIT(11))
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_DRAM0_EXCEPTION_MONITOR_CLR_S 11
/* ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_CLR : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_CLR (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_CLR_M (BIT(10))
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_IRAM0_EXCEPTION_MONITOR_CLR_S 10
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_CLR : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_CLR (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_CLR_M (BIT(9))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MAX_CLR_S 9
/* ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_CLR : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_CLR (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_CLR_M (BIT(8))
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_SP_SPILL_MIN_CLR_S 8
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_CLR : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_CLR (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_CLR_M (BIT(7))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_WR_CLR_S 7
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_CLR : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_CLR (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_CLR_M (BIT(6))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_RD_CLR_S 6
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_CLR : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_CLR (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_CLR_M (BIT(5))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_WR_CLR_S 5
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_CLR (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_CLR_M (BIT(4))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_RD_CLR_S 4
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_CLR : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_CLR (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_CLR_M (BIT(3))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_WR_CLR_S 3
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_CLR : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_CLR (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_CLR_M (BIT(2))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_RD_CLR_S 2
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_CLR (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_CLR_M (BIT(1))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_WR_CLR_S 1
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_CLR : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_CLR (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_CLR_M (BIT(0))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_CLR_V 0x1
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_RD_CLR_S 0

#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0A0)
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN : R/W ;bitpos:[31:0] ;default: ~32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_M ((ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_V) << (ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_S))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MIN_S 0

