espressif/esp-idf/components/soc/soc/esp32s3/include/soc/assist_debug_reg.h
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0A4)
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_M ((ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_V) << (ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_S))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_0_MAX_S 0

#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0A8)
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN : R/W ;bitpos:[31:0] ;default: ~32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_M ((ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_V) << (ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_S))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MIN_S 0

#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0AC)
/* ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_M ((ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_V) << (ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_S))
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_DRAM0_1_MAX_S 0

#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0B0)
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN : R/W ;bitpos:[31:0] ;default: ~32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_M ((ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_V) << (ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_S))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_S 0

#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0B4)
/* ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_M ((ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_V) << (ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_S))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_S 0

#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0B8)
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN : R/W ;bitpos:[31:0] ;default: ~32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_M ((ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_V) << (ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_S))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_S 0

#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0BC)
/* ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_M ((ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_V) << (ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_S))
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_S 0

#define ASSIST_DEBUG_CORE_1_AREA_PC_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0C0)
/* ASSIST_DEBUG_CORE_1_AREA_PC : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_PC 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PC_M ((ASSIST_DEBUG_CORE_1_AREA_PC_V) << (ASSIST_DEBUG_CORE_1_AREA_PC_S))
#define ASSIST_DEBUG_CORE_1_AREA_PC_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_PC_S 0

#define ASSIST_DEBUG_CORE_1_AREA_SP_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0C4)
/* ASSIST_DEBUG_CORE_1_AREA_SP : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_AREA_SP 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_SP_M ((ASSIST_DEBUG_CORE_1_AREA_SP_V) << (ASSIST_DEBUG_CORE_1_AREA_SP_S))
#define ASSIST_DEBUG_CORE_1_AREA_SP_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_AREA_SP_S 0

#define ASSIST_DEBUG_CORE_1_SP_UNSTABLE_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0C8)
/* ASSIST_DEBUG_CORE_1_SP_UNSTABLE : R/W ;bitpos:[7:0] ;default: 8'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_UNSTABLE 0x000000FF
#define ASSIST_DEBUG_CORE_1_SP_UNSTABLE_M ((ASSIST_DEBUG_CORE_1_SP_UNSTABLE_V) << (ASSIST_DEBUG_CORE_1_SP_UNSTABLE_S))
#define ASSIST_DEBUG_CORE_1_SP_UNSTABLE_V 0xFF
#define ASSIST_DEBUG_CORE_1_SP_UNSTABLE_S 0

#define ASSIST_DEBUG_CORE_1_SP_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0CC)
/* ASSIST_DEBUG_CORE_1_SP_MIN : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_MIN 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_MIN_M ((ASSIST_DEBUG_CORE_1_SP_MIN_V) << (ASSIST_DEBUG_CORE_1_SP_MIN_S))
#define ASSIST_DEBUG_CORE_1_SP_MIN_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_MIN_S 0

#define ASSIST_DEBUG_CORE_1_SP_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0D0)
/* ASSIST_DEBUG_CORE_1_SP_MAX : R/W ;bitpos:[31:0] ;default: ~32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_MAX 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_MAX_M ((ASSIST_DEBUG_CORE_1_SP_MAX_V) << (ASSIST_DEBUG_CORE_1_SP_MAX_S))
#define ASSIST_DEBUG_CORE_1_SP_MAX_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_MAX_S 0

#define ASSIST_DEBUG_CORE_1_SP_PC_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0D4)
/* ASSIST_DEBUG_CORE_1_SP_PC : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_SP_PC 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_PC_M ((ASSIST_DEBUG_CORE_1_SP_PC_V) << (ASSIST_DEBUG_CORE_1_SP_PC_S))
#define ASSIST_DEBUG_CORE_1_SP_PC_V 0xFFFFFFFF
#define ASSIST_DEBUG_CORE_1_SP_PC_S 0

#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE_REG (DR_REG_ASSIST_DEBUG_BASE + 0x0D8)
/* ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE (BIT(0))
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE_M (BIT(0))
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE_V 0x1
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGENABLE_S 0

